Repository: 84000/data-translation-memory
Catalog: toh145-v4.tmx
Source language: bo
Languages: en

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཁྱོད་ལ་ཡོངས་སུ་གཏད་དོ།
en: I have entrusted you with this Dharma discourse.

source: །འདི་ནི་ངའི་སྟོན་པ་ཡིན་ཏེ།
en: This is my teacher.

source: དེའི་ཕྱིར་ཁྱོད་ཀྱིས་བསྲུང་བར་བྱའོ།
en: Therefore, you should guard it.

source: །དུས་དུས་སུ་བསྟི་སྟང་གྱིས་ཤིག
en: From time to time, show it respect.

source: །རིན་པོ་ཆེའི་སྣོད་དུ་ཆུག་ལ་ཕྲག་པ་ལ་ཐོགས་ཤིག
en: Place it in a precious container and carry it on your shoulder.

source: །ཕྱི་མའི་ཚེ་ཕྱི་མའི་དུས་ན་དགེ་སློང་སྡིག་པ་ཅན་དེ་དག་ལ་ཡིད་མ་རྟོན་ཅིག
en: In later times and periods, pay no heed to those sinful monks.

source: །རིགས་ཀྱི་བུ་འདི་ནི་ཁྱོད་ལ་རྗེས་སུ་བསྟན་པའོ།
en: Son of a good family, these are my instructions to you.”

source: བཅོམ་ལྡན་འདས་རབ་ཏུ་བྱུང་བ་ཅི་འདྲ་བ་དེ་དག་འབྱུང་བར་འགྱུར།
en: “Blessed One, what sort of people who have gone forth will there be?”

source: རིགས་ཀྱི་བུ་ཁ་རོག་དེ་སྐད་མ་འདྲི་ཤིག
en: “Do not ask in a whisper.”

source: སེམས་ཅན་མང་པོ་ལ་སྨན་པར་བགྱིད་པར་འགྱུར་ལགས་ན། བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “If it would benefit many sentient beings, I beg the Blessed One to kindly give us an explanation.

source: ཀུན་དུ་བཟང་པོ་བཤད་ཀྱིས་ཉོན་ཅིག
en: “Samanta­bhadra, I will explain, so listen!

source: །འཁོར་རྒྱ་མཚོ་ལྟ་བུ་འདི་དང་འཇམ་དཔལ་དང་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ཐམས་ཅད་ཡིད་ལ་བྱེད་པ་གཞན་ཐོང་ལ།
en: Everyone in this great ocean-like assembly and all of these countless bodhisattva great beings such as Mañjuśrī and Avaloki­teśvara should leave off other thoughts

source: ཕྱི་མའི་ཚེ་ཕྱི་མའི་དུས་ན་རབ་ཏུ་བྱུང་བ་ཅི་འདྲ་བ་དག་འབྱུང་བར་འགྱུར་བ་དེ་དག་ཉོན་ཅིག
en: and should heed what sort of people who have gone forth there will be in a later time and period.”

source: །ཀུན་དུ་བཟང་པོ་རབ་ཏུ་བྱུང་བ་དམ་པའི་ཆོས་སུན་འབྱིན་པ།
en: “Samanta­bhadra, people who have gone forth will vex the holy Dharma,

source: ཁྱིམ་ལ་ཆགས་པ།
en: will be attached to homes,

source: རྙེད་པ་ལ་ཆགས་པ།
en: attached to material gain,

source: གཙུག་ལག་ཁང་ལ་ཆགས་པ།
en: attached to temples,

source: གནས་ལ་ཆགས་པ།
en: attached to dwellings,

source: ལྷུང་བཟེད་དང་ཆོས་གོས་ལ་ཆགས་པ།
en: and attached to their begging bowls and robes;

source: ཁྱིམ་སུན་པར་བྱེད་པ།
en: they will bother homes,

source: སྡིག་པའི་ཆོས་ཀུན་དུ་སྤྱོད་པ་དེ་དག་འབྱུང་སྟེ།
en: and will engage in all sinful doctrines.

source: ཀུན་དུ་བཟང་པོ་མི་གཏི་མུག་པ་དེ་དག་གི་དོན་དུ་ངས་མདོ་འདི་ཡོངས་སུ་གཏད་ཀྱིས་མདོ་འདི་ནུབ་པར་གྱུར་ཏ་རེ།
en: Samanta­bhadra, for me to entrust this sūtra for the sake of those ignorant ones would indeed bring this sūtra to its decline.”

source: དེ་ནས་ཕྱོགས་བཅུ་ནས་ལྷ་དང་ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་ཐམས་ཅད་ལྷགས་ཏེ།
en: Then from all directions came gods, nāgas, yakṣas, and gandharvas.

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་ཐམས་ཅད་འདུས་ཤིང་ཚོགས་ཏེ།
en: “Blessed One, we, too, have all assembled and gathered.

source: ཇི་སྲིད་འཚོའི་བར་དང་། དམ་པའི་ཆོས་ཇི་སྲིད་གནས་ཀྱི་བར་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ།
en: As long as we live and for as long as the holy Dharma endures, we will protect this Dharma discourse.

source: །ཆོས་སྨྲ་བའི་དགེ་སློང་དེ་དག་ལ་ཡང་ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ།
en: We will also guard those future Dharma-teaching monks who will maintain it.

source: །བསྟི་སྟང་དུ་བགྱིའོ། །བཙུན་པར་བགྱིའོ། །རིམ་གྲོར་བགྱིའོ། །མཆོད་པར་བགྱིའོ། །རྗེད་པར་བགྱིའོ། །གསོལ་བར་བགྱིའོ།
en: We will pay homage to, adore, honor, worship, venerate, and supplicate them.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་པོ་དེ་དག་ལ་ཡང་དག་པར་སྐུལ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ།
en: Then the Blessed One spoke the following verses of encouragement to the bodhisattva Samanta­bhadra and ninety-two hundred million other bodhisattvas:

source: །ཡོན་ཏན་ཕ་རོལ་ཕྱིན་པ་དེ་དག་གི། །ཡོན་ཏན་ཀུན་བཤད་ཐམས་ཅད་ང་ལས་ཉོན།
en: “Hear from me all the explanations of all the qualities, Of those qualities that are the perfections.

source: །ང་རྒྱལ་རྒྱགས་དང་བག་མེད་སྤང་བྱོས་ལ།
en: Leave aside pride, conceit, and carelessness,

source: །དགའ་ཞིང་མགུ་བའི་ཡིད་ཀྱིས་མཉན་པར་གྱིས།
en: And listen with a happy and delighted mood!

source: །མ་ག་དྷཱ་འདིར་ཤིང་དབང་བྱང་ཆུབ་དྲུང་།
en: “Here in Magadha in the presence of the lord of trees, the Bodhi tree,

source: །རང་བྱུང་མི་ཡི་སེང་གེ་བཞུགས་ཞེས་གྲག
en: It is said that a self-arisen lion of men stayed.

source: །ཏིང་འཛིན་རྣམ་པར་ཐར་བ་མཆོག་ལ་གནས།
en: He dwelled in the absorption of the highest emancipation,

source: །ཤིང་རྒྱལ་ཆེན་པོ་དེ་ཡི་དྲུང་ན་བཞུགས།
en: Living in front of that great king of trees.

source: །ཕྱོགས་བཅུའི་ཞིང་རྡུལ་སྙེད་དང་དེ་ཐབས་ཅིག །སྐྱེས་བུ་དམ་པ་རྣམས་ཀྱིས་དཔའ་བོ་བསྐོར།
en: “That hero was surrounded by sublime men living with him, Numbering as many as the atoms in the buddhafields in all ten directions.

source: །སངས་རྒྱས་ཕལ་ཆེན་ཞེས་བྱའི་ཏིང་ངེ་འཛིན། །ཏིང་འཛིན་དེ་ལ་མི་ཡི་དབང་པོ་གནས།
en: That lord of humans dwelled in an absorption Called buddha multitudes.

source: །མི་དབང་དེ་ནི་སྙོམས་པར་ཞུགས་རྟོགས་ནས།
en: “After that lord of humans had realized the meditative states,

source: །འཇམ་དཔལ་གཞོན་ནུ་ཤར་གྱི་ཕྱོགས་ལོགས་ནས།
en: Mañjuśrī Kumāra­bhūta came from the east

source: །སངས་རྒྱས་ཞིང་བཅུ་རྡུལ་སྙེད་ལྷན་ཅིག་ཏུ། །སྐྱེས་བུ་དམ་པ་རྣམས་དང་རྒྱལ་དྲུང་འོངས།
en: To the presence of the king and the sublime beings Numbering as many as the atoms of ten buddhafields.

source: །དེ་བཞིན་སྦྱར་ཏེ་ཕྱོགས་བཅུའི་ཞིང་ཀུན་ནས།
en: “Engaging similarly, from the fields of the ten directions,

source: །སངས་རྒྱས་སྲས་པོ་དཔལ་ཞེས་བྱ་བ་ཀུན།
en: All the sons of the victors named Bhadra

source: །ཕྱོགས་བཅུའི་ཞིང་རྡུལ་སྙེད་དང་ལྷན་ཅིག་ཏུ། །སྐྱེས་བུ་དམ་པ་རྣམས་དང་ལྷགས་པར་གྱུར།
en: Arrived together with those sublime beings Numbering as many as the atoms in the ten directions.

source: །དེར་འདུས་གྱུར་ནས་འཇིག་རྟེན་ཕན་འདོད་པ།
en: “Having joined that assembly desiring benefit for the world,

source: །འཇམ་དཔལ་གྲགས་པ་མཐའ་ཡས་ལྡན་རྣམས་ལ། །སེམས་ཅན་དམ་པ་བཟང་པོའི་དཔལ་གྱིས་དྲིས།
en: The noble person named Bhadraśrī Asked Mañjuśrī and those possessing infinite fame:

source: །སངས་རྒྱས་སྲས་ཀྱི་སྤྱོད་གང་ཡོན་ཏན་ཅི།
en: ‘What is the conduct of a son of the Buddha? What are his excellent qualities?’

source: །དེ་ནས་སེམས་དཔའ་འཇམ་དཔལ་ཞེས་བྱ་བ། །རྙོག་པ་མེད་པས་བྱང་ཆུབ་ཡོན་ཏན་དང་། །བདེ་ཡངས་ཡོན་ཏན་ལྡན་གྱི་སྤྱོད་ཡུལ་གཙང་། །སེམས་ཅན་དམ་པ་བཟང་པོའི་དཔལ་ལ་དྲིས།
en: “Then the great being named Mañjuśrī Questioned the sublime man Bhadraśrī Who knew without error the qualities of awakening And the pure sphere of experience of those possessing the virtues of extensive happiness:

source: །སངས་རྒྱས་སྲས་པོ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་གཙང་། །རྒྱལ་བས་བསྟེན་པ་བདག་གིས་འདིར་སྨྲས་ཀྱིས།
en: “ ‘I will here explain the pure sphere of experience Of the Buddha’s sons that is relied upon by the Victor.

source: །ཁྱོད་ཀྱང་སངས་རྒྱས་སྲས་ཀྱི་ཡོན་ཏན་དང་། །སྤྱོད་པ་གང་དག་ཡིན་པ་བརྗོད་པར་གྱིས།
en: And you, too, should explain the qualities of the Buddha’s sons And what their modes of conduct are like.’

source: །བཟང་པོའི་དཔལ་གྱིས་སྨྲས་པ་རྒྱལ་སྲས་ཉོན།
en: “Bhadraśrī said, ‘Listen, sons of the victors:

source: །ཡོན་ཏན་མཐའ་ཡས་ལྡན་དེའི་ཡོན་ཏན་ལས།
en: Among all the qualities possessed by those whose qualities are infinite

source: །དཔེ་ཚུལ་ཅུང་ཟད་ཙམ་ཞིག་བརྗོད་པར་བྱ།
en: The ones of which I can describe even a tiny part

source: །རྒྱ་མཚོའི་ཐིག་པ་བཞིན་དུ་ཤིན་ཏུ་ཆུང་།
en: Are as infinitesimally few as a drop in the ocean.

source: །བྱང་ཆུབ་གཞིར་གྱུར་པ་ཡི་རང་བྱུང་སེམས། །ཐོག་མ་ཉིད་དུ་བསྐྱེད་པ་གང་ཡིན་པ།
en: “ ‘If to give rise at the very beginning To the spontaneous thought that is the basis for awakening

source: །དེ་ཡི་ཡོན་ཏན་བསྔགས་པ་མཐའ་ཡས་ཏེ།
en: Is something whose good qualities can be praised without limit

source: །མཚུངས་མེད་ཀྱིས་ཀྱང་ཡོངས་སུ་བརྗོད་མི་སྤྱོད།
en: So that even “incomparable” does not suffice to describe it,

source: །ཕ་རོལ་ཕྱིན་དང་ས་ཡི་ཡོན་ཏན་རྣམས།
en: “ ‘How much more so the qualities of the transcendent perfections and levels

source: །བསྐལ་པ་མང་པོར་སྤྱད་པ་ཅི་སྨོས་ཏེ།
en: When they have been practiced for many eons:

source: །ཕྱོགས་བཅུའི་རྒྱལ་བ་ཀུན་གྱིས་དེ་དག་གི།
en: For all the victors of the ten directions

source: །ཡོན་ཏན་ཆུ་བོ་ཟད་པར་མཛད་མི་སྤྱོད།
en: The river of their qualities is never brought to an end.

source: །ཡོན་ཏན་མཐའ་ཡས་རྣམས་ཀྱི་ཡོན་ཏན་ལས།
en: “ ‘Among all the qualities possessed by those whose qualities are infinite,

source: །དཔེ་ཚུལ་ཅུང་ཟད་ཙམ་ཞིག་བརྗོད་བྱ་སྟེ།
en: The ones of which I can describe even a tiny part

source: །མཁའ་ལ་བྱ་རྗེས་འདྲ་བར་ཆུང་བ་དང་། །ས་ཆེན་རྣམས་ལས་རྡུལ་ཕྲན་གཅིག་དང་མཚུངས།
en: Are as infinitesimally few as the tracks a bird leaves behind in the sky, Or as a single atom compared to the entire earth.

source: །བྱང་ཆུབ་ཡོན་ཏན་གནས་ཀྱི་སེམས་སྐྱེ་བ།
en: “ ‘The arising of the thought to dwell in those qualities of awakening

source: །རྒྱུ་མེད་མ་ཡིན་གྱི་ན་མ་ཡིན་གྱི།
en: Is not without cause, nor is it meaningless;

source: །རྒྱལ་དང་རྒྱལ་བའི་ཆོས་དང་དགེ་འདུན་ལ། །དད་དང་དང་བ་བསྐྱེད་ནས་སེམས་སྐྱེ་སྟེ།
en: Rather, the thought arises after one has produced faith and admiration For the Victor, the Dharma of the Victor, and the Saṅgha.

source: །དེ་ནི་འདོད་དང་ལོངས་སྤྱོད་རྒྱལ་སྲིད་དང་། །བདག་ལ་བདེ་དང་སྙན་དང་གྲགས་ཕྱིར་མིན།
en: “ ‘It is not for the sake of desire or for wealth, Or for one’s own pleasure, fame, and reputation.

source: །འགྲོ་བའི་སྡུག་བསྔལ་མ་ལུས་ཞི་བྱའི་ཕྱིར། །འཇིག་རྟེན་ཕན་པ་བྱེད་པའི་སེམས་སྐྱེའོ།
en: That thought of benefitting the world arises For the sake of quelling all the sufferings of living beings.

source: །རྟག་ཏུ་སེམས་ཅན་ཕན་པར་བྱ་ཕྱིར་དང་།
en: “ ‘That thought arises for the sake of perpetually benefiting sentient beings,

source: །ཞིང་རྣམས་སྦྱང་དང་སངས་རྒྱས་མཆོད་པ་དང་།
en: To purify the fields and worship the Buddha,

source: །ཆོས་ཡོངས་གཟུང་དང་སངས་རྒྱས་བྱང་ཆུབ་དང་།
en: To maintain the Dharma, to gain the awakening of a buddha,

source: །ཡེ་ཤེས་རྣམ་པར་སྦྱང་ཕྱིར་སེམས་དེ་སྐྱེ།
en: And to purify gnosis.

source: །རྒྱལ་བ་ཀུན་དང་ཆོས་དང་དེ་བཞིན་དུ། །འཕགས་པའི་ཚོགས་ལ་རྟག་ཏུ་དད་པ་དང་། །དང་ཞིང་མོས་དང་གུས་པ་རབ་བསྐྱེད་ནས།
en: “ ‘Having generated constant faith in all the victors, in the Dharma, And likewise in the assembly of āryas, And with admiration, appreciation, and devotion toward them,

source: །བླ་མ་གུས་པར་མཆོད་ཕྱིར་སེམས་དེ་སྐྱེ།
en: That thought will arise for the sake of worshiping the guru through devotion.

source: །རྒྱལ་དང་རྒྱལ་བའི་ཆོས་ལ་དད་གྱུར་ཅིང་།
en: “ ‘After one has felt faith in the Victor and the Dharma of the Victor,

source: །སངས་རྒྱས་སྲས་ཀྱི་སྤྱོད་ལ་དད་བྱེད་ལ།
en: One generates faith in the conduct of the Buddha’s sons.

source: །བྱང་ཆུབ་བླ་ན་མེད་ལ་དད་གྱུར་ནས།
en: And after one has felt faith in highest awakening,

source: །སྐྱེས་བུ་ཆེན་པོ་རྣམས་ཀྱི་སེམས་སྐྱེའོ།
en: The thought of the sublime beings will arise.

source: །དད་པའི་སྟོབས་ཀྱིས་མི་བདག་གྱུར་པ་རྣམས།
en: “ ‘Through the power of faith, those lords of humans

source: །བསམ་ཡས་རྒྱ་ཆེན་མཆོད་པས་མཆོད་བྱས་ཤིང་།
en: Worship through unimaginably vast offerings.

source: །ཆོས་དང་དེ་བཞིན་མི་ཕྱེད་དགེ་འདུན་ལ། །བསམ་ཡས་མཆོད་པས་མཆོད་ནས་སེམས་སྐྱེའོ།
en: And there arises the thought after they have also worshiped Through inconceivably vast offerings the Dharma and Saṅgha, which are inseparable.

source: །དད་པ་སྔོན་འདྲེན་མ་ལྟར་སྐྱེད་པ་སྟེ།
en: “ ‘Faith is the starting point, the mother of guides.

source: །ཡོན་ཏན་ཐམས་ཅད་སྲུང་ཞིང་འཕེལ་བར་བྱེད།
en: It guards and increases all good qualities.

source: །དོགས་པ་སེལ་ཅིང་ཆུ་བོ་རྣམས་ལས་སྒྲོལ།
en: It removes all doubts and rescues one from the torrents of ailments.

source: །དད་པ་བདེ་བའི་གྲོང་ཁྱེར་མཚོན་པ་ཡིན།
en: Faith is exemplified by the city of happiness.

source: །དད་པ་རྙོག་པ་མེད་ཅིང་སེམས་དང་བྱེད།
en: “ ‘Faith is unclouded and clarifies the mind.

source: །ང་རྒྱལ་སྤོང་ཞིང་གུས་པའི་རྩ་བ་ཡིན།
en: It removes pride and is the root of devotion.

source: །དད་པ་གཏེར་དང་ནོར་དང་རྐང་པའི་མཆོག །ལག་པ་བཞིན་དུ་དགེ་སྡུད་རྩ་བ་ཡིན།
en: Faith is treasure, wealth, and the best of pillars. It is the fundamental gatherer of virtue, like a hand.

source: །དད་པ་ཡོངས་སུ་གཏོང་ལ་དགའ་བར་བྱེད།
en: “ ‘Faith makes one like to give things up.

source: །དད་པ་རྒྱལ་བའི་ཆོས་ལ་རབ་དགའ་སྐྱེད།
en: Faith makes one delight in the Dharma of the Victor.

source: །དད་པ་ཡོན་ཏན་ཡེ་ཤེས་ཁྱད་པར་བྱེད།
en: Faith makes good qualities into special features of gnosis.

source: །སངས་རྒྱས་གོ་འཕང་སྟོན་ཅིང་ཐོབ་པར་བྱེད།
en: It reveals the rank of buddhahood and makes one attain it.

source: །དབང་པོ་རྣོ་ཞིང་རབ་ཏུ་གསལ་བར་བྱེད།
en: “ ‘It makes the faculties sharp and very lucid.

source: །དད་པའི་སྟོབས་ལ་གཞན་གྱིས་མི་རྫི་ཞིང་།
en: The power of faith is not undermined by others.

source: །ཉོན་མོངས་རྣམ་པར་སེལ་བའི་གཞི་རྟེན་ཡིན།
en: It is the foundation for removing the defilements.

source: །དད་པ་རང་འབྱུང་ཡོན་ཏན་རྣམས་བྱང་ཚོལ།
en: Faith also searches out the innate qualities.

source: །དད་པ་ཆགས་པའི་སྒོ་ལ་ཆགས་པ་མེད།
en: “ ‘Faith has no attachment to the doors of attachment.

source: །མི་དལ་སྤངས་ཤིང་དལ་བའི་མཆོག་གཅིག་ཡིན།
en: It removes inopportune things and is the single best opportunity.

source: །དད་པ་བདུད་ཀྱི་ལམ་ལས་འདའ་བྱེད་ཅིང་། །ཐར་པའི་ལམ་མཆོག་སྟོན་པར་བྱེད་པ་ཡིན།
en: It makes one escape from the path of Māra And reveals the highest path to liberation.

source: །ཡོན་ཏན་ཞིང་གི་ས་བོན་མ་རུལ་པ།
en: “ ‘Faith is the unspoiled seed of the field of good qualities.

source: །དད་པ་བྱང་ཆུབ་ཞིང་ནི་རྣམ་པར་སྐྱེད།
en: Faith produces the field of awakening.

source: །ཡེ་ཤེས་ཁྱད་པར་ཡོན་ཏན་འཕེལ་བར་བྱེད།
en: It increases the good qualities of the special features of gnosis.

source: །དད་པ་རྒྱལ་བ་ཐམས་ཅད་སྟོན་པ་ཡིན།
en: Faith reveals all victors.

source: །དད་པས་མོས་པའི་ཁྱད་པར་དགའ་རྣམས་ཀྱི།
en: “ ‘Through faith, there are different sorts of delight in devotion.

source: །དེ་ལ་སྤྱོད་པ་རིམ་གྱིས་བརྗོད་པར་བྱ།
en: Concerning that, I will gradually explain the practice.

source: །འདི་འདྲའི་ཆོས་ནི་འཇིག་རྟེན་རབ་དཀོན་ཏེ།
en: This sort of Dharma teaching is very rare in the world,

source: །རྒྱ་མཚོའི་ནང་ན་རིན་ཆེན་རྒྱལ་པོ་བཞིན།
en: Like the king of jewels in the ocean.

source: །གང་དག་རྟག་ཏུ་སངས་རྒྱས་དད་གུས་པ།
en: “ ‘Those who have faith and devotion toward the Buddha

source: །དེ་དག་ཚུལ་ཁྲིམས་བསླབ་པ་ཡོངས་མི་འདོར།
en: Will not abandon the rules of moral conduct.

source: །ཡོན་ཏན་ལྡན་དེ་ཡོན་ཏན་ལྡན་པས་བསྟོད།
en: Possessing good qualities, They will be praised by those endowed with good qualities.

source: །ཚུལ་ཁྲིམས་བྱང་ཆུབ་སེམས་སྟོན་བྱེད་པ་སྟེ།
en: “ ‘Moral conduct reveals the thought of awakening.

source: །སློབ་པའི་ས་ཡི་ཡོན་ཏན་རྣམས་ལ་སྦྱོར།
en: It inures one to the good qualities of the level of a trainee.

source: །ཚུལ་ཁྲིམས་བསླབ་པ་འདོར་བར་མི་བྱེད་པ།
en: Those who do not abandon the rules of moral conduct

source: །དེ་དག་རྒྱལ་བས་བསྔགས་པའི་འོས་སུ་འགྱུར།
en: Will become worthy of the Victor’s praise.

source: །དེ་དག་རྒྱལ་ལ་མཆོད་པ་རྒྱ་ཆེན་བྱེད།
en: Will make vast offerings in his honor.

source: །གང་དག་རྒྱལ་ལ་མཆོད་པ་ཆེ་བྱེད་པ།
en: They who make vast offerings

source: །དེ་དག་སངས་རྒྱས་དད་པ་བསམ་མི་ཁྱབ།
en: Will have inconceivably great faith in the Buddha.

source: །གང་དག་རྟག་ཏུ་ཆོས་ལ་དད་གུས་པ།
en: “ ‘Those who have constant faith in and devotion toward the Dharma

source: །དེ་དག་རྒྱལ་བར་ཆོས་ཉན་ངོམས་པ་མེད།
en: Will be insatiable in desiring to learn the Victor’s Dharma.

source: །གང་དག་རྒྱལ་བའི་ཆོས་ཉན་མི་ངོམས་པ།
en: Those who are insatiable in desiring to learn Dharma

source: །དེ་དག་ཆོས་ལ་མོས་པ་བསམ་མི་ཁྱབ།
en: Will have inconceivably great faith in the Dharma.

source: །གང་དག་རྟག་ཏུ་དགེ་འདུན་དད་གུས་པ།
en: “ ‘Those who have constant faith in and devotion toward the Saṅgha

source: །དེ་དག་མི་ལྡོག་དགེ་འདུན་དད་པ་ཡིན།
en: Will be irreversible in their faith in the Saṅgha.

source: །གང་དག་མི་ལྡོག་དགེ་འདུན་རབ་དད་པ།
en: Those who are irreversible in their faith in the Saṅgha

source: །དེ་དག་དད་པའི་སྟོབས་ཀྱིས་མི་ལྡོག་འགྱུར།
en: Will not turn back thanks to the power of their faith.

source: །གང་དག་དད་པའི་སྟོབས་ཀྱིས་མི་ལྡོག་པ།
en: “ ‘Those who do not turn back thanks to the power of their faith

source: །དེ་དག་དབང་པོ་རྣོ་ཞིང་རབ་ཏུ་གསལ།
en: Will have faculties that are sharp and very lucid.

source: །གང་དག་དབང་པོ་རྣོ་ཞིང་རབ་གསལ་བ།
en: “ ‘Those who have faculties that are sharp and very lucid

source: །དེ་དག་སྡིག་པའི་གྲོགས་པོ་རྣམ་པར་སྤངས།
en: Will shun sinful friends.

source: །གང་དག་སྡིག་པའི་གྲོགས་པོ་རྣམ་སྤངས་པ།
en: Those who shun sinful friends

source: །དེ་དག་ཆོས་ལྡན་གྲོགས་ཀྱིས་ཡོངས་སུ་བཟུང་།
en: Will be assisted by virtuous friends.

source: །གང་དག་ཆོས་ལྡན་གྲོགས་ཀྱིས་ཡོངས་བཟུང་བ།
en: “ ‘Those who will be assisted by virtuous friends

source: །དེ་དག་དགེ་བ་རྒྱ་ཆེན་སོགས་པར་བྱེད།
en: Will accumulate a vast amount of virtue.

source: །གང་དག་དགེ་བ་རྒྱ་ཆེན་སོགས་བྱེད་པ།
en: Those who accumulate a vast amount of virtue—

source: །བདག་ཉིད་ཆེན་པོ་དེ་དག་རྒྱུ་སྟོབས་ལྡན།
en: Such great beings will possess a powerful cause.

source: །བདག་ཉིད་ཆེན་པོ་རྒྱུ་སྟོབས་གང་ལྡན་པ།
en: “ ‘Great beings who possess a powerful cause

source: །དེ་དག་མོས་པའི་ཁྱད་པར་རྒྱ་ཆེན་འགྱུར།
en: Will have a great difference in their devotion.

source: །གང་དག་མོས་པའི་ཁྱད་པར་རྒྱ་ཆེ་བ།
en: Those who have a great difference in their devotion

source: །དེ་དག་རྒྱལ་བ་ཀུན་གྱིས་རྟག་བྱིན་བརླབས།
en: Will be magically blessed by all the victors.

source: །གང་དག་རྒྱལ་བ་ཀུན་གྱིས་བྱིན་བརླབས་པ།
en: “ ‘Those who are magically blessed by all the victors

source: །དེ་དག་བྱང་ཆུབ་དོན་དུ་སེམས་ཀྱང་སྐྱེ།
en: Will also produce a mind set on awakening.

source: །གང་དག་བྱང་ཆུབ་དོན་དུ་སེམས་སྐྱེ་བ།
en: Those who produce a mind for the sake of awakening

source: །དེ་དག་དྲང་སྲོང་ཆེན་པོའི་ཡོན་ཏན་བརྩོན།
en: Will exert themselves in the good qualities of a great seer.

source: །དྲང་སྲོང་ཆེན་པོའི་ཡོན་ཏན་གང་བརྩོན་པ།
en: “ ‘Those who exert themselves in the good qualities of a great seer

source: །དེ་དག་རིགས་མཐོ་སངས་རྒྱས་རིགས་སུ་སྐྱེ།
en: Will be born in the high lineage of the buddhas.

source: །གང་དག་རིགས་མཐོ་སངས་རྒྱས་རིགས་སྐྱེས་པ།
en: Those who have been born in the high lineage of the buddhas

source: །དེ་དག་མཉམ་ཞིང་སྦྱོར་དང་མི་སྦྱོར་སྤངས།
en: Will be equal to them and thus done with joining or not joining them.

source: །མཉམ་ཞིང་སྦྱོར་དང་མི་སྦྱོར་གང་སྤངས་པ།
en: “ ‘Those equal and thus done with joining or not joining

source: །དེ་དག་དད་དང་བསམ་པ་རྣམ་པར་དག
en: Will have faith and minds that are pure.

source: །གང་དག་དད་དང་བསམ་པ་རྣམ་དག་པ།
en: Those who have faith and minds that are pure

source: །དེ་དག་ལྷག་པའི་བསམ་པ་དམ་པ་མཆོག
en: Will have the highest noble altruism.

source: །གང་དག་ལྷག་བསམ་དམ་པ་མཆོག་ལྡན་པ།
en: “ ‘Those who have the highest noble altruism

source: །དེ་དག་རྟག་ཏུ་ཕ་རོལ་ཕྱིན་པ་སྤྱོད།
en: Will always practice the perfections.

source: །གང་དག་རྟག་ཏུ་ཕ་རོལ་ཕྱིན་སྤྱོད་པ།
en: Those who always practice the perfections

source: །དེ་དག་ཐེག་པ་ཆེན་པོ་འདི་ལ་ཞུགས།
en: Will enter into this Mahāyāna.

source: །གང་དག་ཐེག་པ་ཆེན་པོ་འདིར་ཞུགས་པ།
en: “ ‘Those who enter into this Mahāyāna

source: །དེ་དག་སངས་རྒྱས་རྣམས་ལ་སྒྲུབ་པས་མཆོད།
en: Will worship the buddhas through practice.

source: །གང་དག་སྒྲུབ་པས་སངས་རྒྱས་མཆོད་བྱེད་པ།
en: Those who worship the buddhas through practice

source: །དེ་དག་སངས་རྒྱས་རྗེས་སུ་དྲན་མི་ཕྱེད།
en: Will have constant mindfulness of the Buddha.

source: །གང་དག་སངས་རྒྱས་རྗེས་དྲན་མི་ཕྱེད་པ།
en: “ ‘Those who have constant mindfulness of the Buddha

source: །དེ་དག་རྟག་ཏུ་སངས་རྒྱས་བསམ་ཡས་མཐོང་།
en: Will always see inconceivable buddhas.

source: །གང་དག་སངས་རྒྱས་བསམ་ཡས་རྟག་མཐོང་བ།
en: Those who always see inconceivable buddhas

source: །དེ་ལ་ནམ་ཡང་སངས་རྒྱས་མི་བཞུགས་མིན།
en: Will never have buddhas not residing.

source: །གང་དག་ནམ་ཡང་སངས་རྒྱས་མི་བཞུགས་མིན།
en: “ ‘Those who never have buddhas not residing

source: །དེ་དག་བར་སྐབས་ཆོས་ལས་ཉམས་མི་འགྱུར།
en: Will never be impaired from the Dharma in the meantime.

source: །གང་དག་བར་སྐབས་ཆོས་ལས་མི་ཉམས་པ།
en: Those who will never be impaired from the Dharma in the meantime

source: །དེ་དག་སྤོབས་པ་སྒྲིབ་པ་མེད་པར་འགྱུར།
en: Will have eloquence that is without obscuration.

source: །གང་དག་སྤོབས་པ་སྒྲིབ་པ་མེད་གྱུར་པ།
en: “ ‘Those whose eloquence is without obscuration

source: །དེ་དག་ཆོས་རབ་སྟོན་པ་མཐའ་ཡས་འགྱུར།
en: Will be boundless in teaching the Dharma.

source: །གང་དག་ཆོས་རབ་སྟོན་པ་མཐའ་ཡས་པ།
en: Those who are boundless in teaching the Dharma

source: །དེ་དག་འགྲོ་ལ་བྱམས་ཤིང་ཕན་པར་འདོད།
en: Will be kind to living beings and desire to benefit them.

source: །གང་དག་འགྲོ་ལ་བྱམས་ཤིང་ཕན་འདོད་པ།
en: “ ‘Those who are kind to living beings and desire to benefit them

source: །དེ་དག་སྙིང་རྗེ་ཆེན་པོའི་རྩ་བ་བརྟན།
en: Will have a firm root of great compassion.

source: །གང་དག་སྙིང་རྗེ་ཆེན་པོའི་རྩ་བརྟན་པ།
en: Those who have a firm root of great compassion

source: །དེ་དག་ཆོས་དགའ་དགའ་བའི་དབང་པོར་འགྱུར།
en: Will have the faculty of joy through delighting in Dharma.

source: །གང་དག་ཆོས་དགའ་དགའ་བའི་དབང་པོ་ཅན།
en: “ ‘Those who have the faculty of joy through delighting in Dharma

source: །དེ་དག་འདུས་བྱས་སྐྱོན་གྱིས་ཡལ་བར་བོར།
en: Will cast aside the fault of conditioned things.

source: །གང་དག་འདུས་བྱས་སྐྱོན་གྱིས་ཡལ་བོར་བ།
en: Those who tolerate the fault of conditioned things

source: །དེ་དག་ང་རྒྱལ་རྒྱགས་མེད་བག་མེད་མིན།
en: Will be without pride and conceit and not unrestrained.

source: །གང་དག་ང་རྒྱལ་རྒྱགས་མེད་བག་མེད་མིན།
en: “ ‘Those who will be without pride and conceit and not unrestrained

source: །དེ་དག་རྟག་ཏུ་བདག་དང་གཞན་དོན་བརྩོན།
en: Will always exert themselves for the sake of self and others.

source: །གང་དག་རྟག་ཏུ་བདག་གཞན་དོན་བརྩོན་པ།
en: Those who always exert themselves for the sake of self and others

source: །དེ་དག་འཁོར་བར་ཡོངས་སུ་སྐྱོ་བ་མེད།
en: Will not be discouraged by saṃsāra.

source: །གང་དག་འཁོར་བར་ཡོངས་སུ་མི་སྐྱོ་བ།
en: “ ‘Those who will not be discouraged by saṃsāra

source: །དེ་དག་རྟུན་པ་དམ་པ་མཆོག་དང་ལྡན།
en: Will possess the highest of noble diligence.

source: །གང་དག་རྟུན་པ་དམ་པ་མཆོག་ལྡན་པ།
en: Those who possess the highest of noble diligence

source: །དེ་དག་མངོན་ཤེས་རྣམ་པར་དག་པ་སྐྱེས།
en: Will give birth to pure clairvoyance.

source: །གང་དག་མངོན་ཤེས་རྣམ་པར་དག་སྐྱེས་པ།
en: “ ‘Those who will give birth to pure clairvoyance

source: །དེ་དག་འགྲོ་བའི་སྤྱོད་པ་མང་པོ་རྟོགས།
en: Will understand the many behaviors of living beings.

source: །གང་དག་འགྲོ་བའི་སྤྱོད་པ་མང་རྟོགས་པ།
en: Those who understand the many behaviors of living beings

source: །དེ་དག་འགྲོ་བ་ཡོངས་སུ་སྨིན་བྱེད་མཁས།
en: Will be skilled in maturing beings.

source: །འགྲོ་བ་ཡོངས་སུ་སྨིན་བྱེད་གང་མཁས་པ།
en: “ ‘Those who will be skilled in maturing beings

source: །དེ་དག་འགྲོ་བ་སྡུད་ཤེས་ཆོ་ག་མཁས།
en: Will be skilled in the procedure of knowing how to attract beings.

source: །འགྲོ་བ་སྡུད་ཤེས་ཆོ་ག་སུ་མཁས་པ།
en: Those who are skilled in the procedure of knowing how to attract beings

source: །དེ་དག་བསྡུ་བའི་དངོས་པོ་བཞི་ལ་བརྩོན།
en: Will exert themselves in the four factors of attraction.

source: །གང་དག་བསྡུ་བའི་དངོས་པོ་བཞིར་བརྩོན་པ།
en: “ ‘Those who exert themselves in the four factors of attraction

source: །དེ་དག་འགྲོ་བའི་དོན་ནི་མཐའ་ཡས་བྱེད།
en: Will make the welfare of living beings infinite.

source: །གང་དག་འགྲོ་དོན་མཐའ་ཡས་བྱེད་གྱུར་པ།
en: Those who make the welfare of living beings infinite

source: །དེ་དག་ཤེས་རབ་ཐབས་ལ་རྟེན་པ་ཡིན།
en: Will rely upon discriminative wisdom and methods.

source: །གང་དག་ཤེས་རབ་ཐབས་ལ་རྟེན་གྱུར་པ།
en: “ ‘Those who rely upon discriminative wisdom and methods—

source: །དཔའ་བོ་དེ་དག་བླ་མེད་ལམ་ལ་གནས།
en: Such heroes dwell on the insuperable path.

source: །དཔའ་བོ་གང་དག་བླ་མེད་ལམ་གནས་པ།
en: Such heroes who dwell on the insuperable path

source: །དེ་དག་བདུད་དཔུང་རྣམས་ཀྱིས་ཡོངས་མི་ཚུགས།
en: Will not be harmed by the assemblies of Māra.

source: །གང་དག་བདུད་དཔུང་རྣམས་ཀྱིས་མི་ཚུགས་པ།
en: “ ‘Those who are not harmed by the assemblies of Māra

source: །དེ་དག་བདུད་ཀྱི་ལམ་ལས་རབ་ཏུ་འདས།
en: Will transcend the path of Māra.

source: །གང་དག་བདུད་ཀྱི་ལམ་ལས་རབ་འདས་པ།
en: Those who transcend the path of Māra

source: །དེ་དག་མི་ལྡོག་ས་ནི་རྗེས་སུ་འཐོབ།
en: Will attain an irreversible level.

source: །གང་དག་མི་ལྡོགས་ནི་ཐོབ་གྱུར་པ།
en: “ ‘Those who will attain an irreversible level

source: །དེ་དག་མི་སྐྱེ་བཟོད་པ་ཐོབ་པ་ཡིན།
en: Attain the forbearance of unborn factors.
